doc: update README
